Tekla.Structures.DrawingInternal.Synchronize
Synchronization class for .NET picking and synced commands where we
start a command and wait for it to complete.

Tekla.Structures.DrawingInternal.Synchronize.Sync
Releases the sync handle. Called from TeklaStructures.exe

Tekla.Structures.DrawingInternal.Synchronize.WaitForSynchronization
Waits until sync handle is released.

Tekla.Structures.DrawingInternal.Synchronize.Reset
Reset the sync handle

Tekla.Structures.DrawingInternal.Synchronize.GetSyncCallback
Get sync callback to Sync()